LeslieLeung/espnow-walkie-talkie/sdkconfig.defaults.esp32s31
# ESP-Mosaico (ESP32-S31, dual-core RISC-V, 16MB flash, 250 MHz octal PSRAM)
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

CONFIG_CODEC_ES8311_SUPPORT=y
# Keep LVGL 8.4 in this app. The mosaico BSP display path pulls esp_lvgl_adapter
# (LVGL 9), so the walkie HAL brings up CO5300/CST9217 itself.
CONFIG_BSP_DISPLAY_ENABLE=n
CONFIG_BSP_CO5300_ENABLE_TE=n
# CO5300 QSPI wants big-endian RGB565 on the wire.
CONFIG_LV_COLOR_16_SWAP=y
